PeleAB/STM32N6-FaceRecognition/Src/main.c
#include "dummy_dual_buffer.h"

/**
 * @brief Load dual dummy buffers for consistent testing
 * @note This overrides both img_buffer and nn_rgb with test image data
 *       ensuring face detection and cropping coordinates are consistent
 */
static void load_dual_dummy_buffers(void)
{
    printf("🔄 Loading dual dummy buffers (test image)...\n");
    /* Load nn_rgb (128x128 RGB888) for neural network input */
    memcpy(nn_rgb, dummy_test_nn_rgb, DUMMY_TEST_NN_RGB_SIZE);
    /* Invalidate cache after loading PSRAM data */
    SCB_InvalidateDCache_by_Addr((uint32_t*)nn_rgb, DUMMY_TEST_NN_RGB_SIZE);
    printf("   🧠 nn_rgb: 128x128 RGB888 (%d bytes)\n", DUMMY_TEST_NN_RGB_SIZE);
    
    printf("✅ Dual dummy buffers loaded: consistent test data for detection + cropping\n");
}
#endif /* DUMMY_INPUT_BUFFER */

/* Application Context */
static app_context_t g_app_ctx = {
    .pipe_state = PIPE_STATE_DETECT_AND_VERIFY,
    .face_detected = false,
    .face_verified = false,
    .current_similarity = 0.0f,
    .embedding_valid = 0,
    .button_press_ts = 0,
    .prev_button_state = 0,
    .target_detection_history = {false},
    .history_index = 0,
    .history_count = 0,
    .target_detected = false,
    .last_stable_verification_ts = 0,
    .led_timeout_active = false
};


/* Function Prototypes */
static int nn_init_detection(nn_context_t *nn_ctx);
static int nn_init_recognition_lazy(nn_context_t *nn_ctx);
static void nn_cleanup(nn_context_t *nn_ctx);
static int app_init(app_context_t *ctx);
static int app_main_loop(app_context_t *ctx);
static void app_camera_init(uint32_t *pitch_nn);
static void app_display_init(void);
static void app_input_start(void);
static int  app_get_frame(uint8_t *dest, uint32_t pitch_nn);
static void app_output(pd_postprocess_out_t *res, uint32_t inf_ms, uint32_t boot_ms, const app_context_t *ctx);
static void handle_user_button(app_context_t *ctx);
static float verify_box(app_context_t *ctx, const pd_pp_box_t *box);
static void process_frame_detections(app_context_t *ctx, pd_pp_box_t *boxes, uint32_t box_count);
static void update_led_status(app_context_t *ctx);
static void update_target_detection_history(app_context_t *ctx, bool target_found_this_frame);
static void compute_target_detection_status(app_context_t *ctx);
static float run_face_recognition_on_face(app_context_t *ctx, const pd_pp_box_t *box);
static int convert_box_coordinates(const pd_pp_box_t *box, pixel_coords_t *pixel_coords);
static int crop_face_region(const pixel_coords_t *coords, uint8_t *output_buffer);
static float calculate_face_similarity(const float32_t *embedding, const float32_t *target_embedding, uint32_t embedding_size);
static void cleanup_nn_buffers(float32_t **nn_out, int32_t *nn_out_len, int number_output);

/* Neural Network Instance Declarations */
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(face_detection);
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(face_recognition);

/**
 * @brief Initialize face detection network only (for faster boot)
 * @param nn_ctx Neural network context to initialize
 * @return 0 on success, negative on error
 */
static int nn_init_detection(nn_context_t *nn_ctx)
{
    /* Clear context */
    memset(nn_ctx, 0, sizeof(*nn_ctx));
    
    /* Initialize Face Detection Network */
    const LL_Buffer_InfoTypeDef *detection_in_info = LL_ATON_Input_Buffers_Info_face_detection();
    const LL_Buffer_InfoTypeDef *detection_out_info = LL_ATON_Output_Buffers_Info_face_detection();
    
    if (!detection_in_info || !detection_out_info) {
        return -1; /* Failed to get buffer info */
    }
    
    /* Setup detection input buffer */
    nn_ctx->detection_input_buffer = (uint8_t *) LL_Buffer_addr_start(&detection_in_info[0]);
    nn_ctx->detection_input_length = LL_Buffer_len(&detection_in_info[0]);
    
    /* Setup detection output buffers */
    nn_ctx->detection_output_count = 0;
    while (detection_out_info[nn_ctx->detection_output_count].name != NULL && 
           nn_ctx->detection_output_count < MAX_NUMBER_OUTPUT) {
        nn_ctx->detection_output_buffers[nn_ctx->detection_output_count] = 
            (float32_t *) LL_Buffer_addr_start(&detection_out_info[nn_ctx->detection_output_count]);
        nn_ctx->detection_output_lengths[nn_ctx->detection_output_count] = 
            LL_Buffer_len(&detection_out_info[nn_ctx->detection_output_count]);
        nn_ctx->detection_output_count++;
    }
    
    nn_ctx->detection_initialized = true;
    
    printf("✅ Face Detection Network Ready: %lu bytes, %d outputs\n", 
           nn_ctx->detection_input_length, nn_ctx->detection_output_count);
    
    return 0;
}

/**
 * @brief Initialize face recognition network lazily (when first face detected)
 * @param nn_ctx Neural network context to initialize
 * @return 0 on success, negative on error
 */
static int nn_init_recognition_lazy(nn_context_t *nn_ctx)
{
    if (nn_ctx->recognition_initialized) {
        return 0; /* Already initialized */
    }
    
    /* Initialize Face Recognition Network */
    const LL_Buffer_InfoTypeDef *recognition_in_info = LL_ATON_Input_Buffers_Info_face_recognition();
    const LL_Buffer_InfoTypeDef *recognition_out_info = LL_ATON_Output_Buffers_Info_face_recognition();
    
    if (!recognition_in_info || !recognition_out_info) {
        return -2; /* Failed to get face recognition buffer info */
    }
    
    /* Setup recognition buffers */
    nn_ctx->recognition_input_buffer = (uint8_t *) LL_Buffer_addr_start(&recognition_in_info[0]);
    nn_ctx->recognition_input_length = LL_Buffer_len(&recognition_in_info[0]);
    nn_ctx->recognition_output_buffer = (float32_t *) LL_Buffer_addr_start(&recognition_out_info[0]);
    nn_ctx->recognition_output_length = LL_Buffer_len(&recognition_out_info[0]);
    
    nn_ctx->recognition_initialized = true;
    
    printf("✅ Face Recognition Network Loaded: %lu bytes → %lu bytes\n", 
           nn_ctx->recognition_input_length, nn_ctx->recognition_output_length);
    
    return 0;
}

/**
 * @brief Clean up neural network resources
 * @param nn_ctx Neural network context to clean up
 */
static void nn_cleanup(nn_context_t *nn_ctx)
{
    if (nn_ctx && (nn_ctx->detection_initialized || nn_ctx->recognition_initialized)) {
        /* Clean up any network-specific resources if needed */
        memset(nn_ctx, 0, sizeof(*nn_ctx));
        printf("🧹 Neural Networks cleaned up\n");
    }
}
/* ========================================================================= */
/* FUNCTION IMPLEMENTATIONS                                                  */
/* ========================================================================= */
/**
 * @brief Initialize camera system only (optimized for concurrent startup)
 * @param pitch_nn Pointer to neural network pitch value
 */
static void app_camera_init(uint32_t *pitch_nn)
{
#if INPUT_SRC_MODE == INPUT_SRC_CAMERA
    CAM_Init(&lcd_bg_area.XSize, &lcd_bg_area.YSize, pitch_nn);
#else
    lcd_bg_area.XSize = NN_WIDTH;
    lcd_bg_area.YSize = NN_HEIGHT;
    (void)pitch_nn;
#endif
}

/**
 * @brief Initialize display system only (optimized for concurrent startup)
 */
static void app_display_init(void)
{
#ifdef ENABLE_LCD_DISPLAY
    LCD_init();
#endif
}

/**
 * @brief Start camera and display pipes (after both systems are initialized)
 */
static void app_input_start(void)
{
#if INPUT_SRC_MODE == INPUT_SRC_CAMERA
    CAM_DisplayPipe_Start(img_buffer, CMW_MODE_CONTINUOUS);
#endif
}

/**
 * @brief Capture frame from camera or PC stream
 * @param dest Destination buffer for frame data
 * @param pitch_nn Neural network pitch value
 * @return 0 on success, non-zero on failure
 */
static int app_get_frame(uint8_t *dest, uint32_t pitch_nn)
{
#if INPUT_SRC_MODE == INPUT_SRC_CAMERA
    CAM_IspUpdate();
    
    uint8_t *capture_buffer = (pitch_nn != (NN_WIDTH * NN_BPP)) ? dcmipp_out_nn : dest;
    CAM_NNPipe_Start(capture_buffer, CMW_MODE_SNAPSHOT);

    /* Optimized frame capture - reduced blocking time */
    while (cameraFrameReceived == 0) {
        /* Could add a timeout here for better responsiveness */
    }
    cameraFrameReceived = 0;
    SCB_InvalidateDCache_by_Addr(dest, NN_WIDTH * NN_HEIGHT * NN_BPP);

