PeleAB/STM32N6-FaceRecognition/Src/main.c
    /* Run face recognition inference */
    RunNetworkSync(&NN_Instance_face_recognition);
    SCB_InvalidateDCache_by_Addr(ctx->nn_ctx.recognition_output_buffer, 
                                ctx->nn_ctx.recognition_output_length);
    
    /* Convert output to float embedding */
    for (uint32_t i = 0; i < EMBEDDING_SIZE; i++) {
        embedding[i] = ((float32_t)ctx->nn_ctx.recognition_output_buffer[i]);
    }
    
    /* Calculate similarity */
    float similarity = calculate_face_similarity(embedding, target_embedding, EMBEDDING_SIZE);
    
    /* Store embedding in context (for button press functionality) */
    /* The last face processed will have its embedding stored - this will be overwritten */
    /* but the process_frame_detections will ensure best face embedding is preserved */
    for (uint32_t i = 0; i < EMBEDDING_SIZE; i++) {
        ctx->current_embedding[i] = embedding[i];
    }
    ctx->embedding_valid = 1;
    
    /* Send results via PC stream */
    Enhanced_PC_STREAM_SendFrame(fr_rgb, FACE_RECOGNITION_WIDTH, 
                                FACE_RECOGNITION_HEIGHT, NN_BPP, "ALN", NULL, NULL);
    Enhanced_PC_STREAM_SendEmbedding(embedding, EMBEDDING_SIZE);
    
    LL_ATON_RT_DeInit_Network(&NN_Instance_face_recognition);
    return similarity;
}

/**
 * @brief Handle user button press events
 * @param ctx Application context
 */
static void handle_user_button(app_context_t *ctx)
{
    int current_state = BSP_PB_GetState(BUTTON_USER1);
    
    /* Detect button press */
    if (current_state && !ctx->prev_button_state) {
        ctx->button_press_ts = HAL_GetTick();
    }
    /* Detect button release */
    else if (!current_state && ctx->prev_button_state) {
        uint32_t duration = HAL_GetTick() - ctx->button_press_ts;
        
        if (duration >= BUTTON_LONG_PRESS_DURATION_MS) {
            /* Long press: reset embeddings bank */
            embeddings_bank_reset();
        } else if (ctx->embedding_valid) {
            /* Short press: add current embedding */
            embeddings_bank_add(ctx->current_embedding);
        }
    }
    
    ctx->prev_button_state = current_state;
}


/**
 * @brief Legacy verify_box function - now uses run_face_recognition_on_face
 * @param ctx Application context
 * @param box Bounding box to verify
 * @return Similarity score (0.0 to 1.0)
 */
static float verify_box(app_context_t *ctx, const pd_pp_box_t *box)
{
    /* Legacy function - just call the new implementation */
    return run_face_recognition_on_face(ctx, box);
}

/**
 * @brief Initialize application context and neural networks
 * @param ctx Application context
 */
/**
 * @brief Initialize application context and subsystems
 * @param ctx Application context pointer
 * @return 0 on success, negative on error
 */
static int app_init(app_context_t *ctx)
{
    int ret = 0;
    
    /* Initialize configuration manager */
    ret = config_manager_init(&ctx->config);
    if (ret < 0) {
        return ret;
    }
    
    /* Critical path: System initialization */
    App_SystemInit();
    LL_ATON_RT_RuntimeInit();
    
    /* Parallel initialization of independent components */
    /* Initialize embeddings bank */
    embeddings_bank_init();
    
    /* Initialize hardware components concurrently */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Off(LED1);
    BSP_LED_Off(LED2);
    BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_GPIO);
    
    /* Initialize face detection network only (lazy load face recognition) */
    ret = nn_init_detection(&ctx->nn_ctx);
    if (ret < 0) {
        printf("❌ Face detection network initialization failed: %d\n", ret);
        return ret;
    }
    
    /* Background initialization - can be done while other systems start */
    Enhanced_PC_STREAM_Init();
    app_postprocess_init(&ctx->pp_params);
    
    return 0;
}

/**
 * @brief Process frame detections - simplified tracker-free approach
 * @param ctx Application context
 * @param boxes Detected bounding boxes
 * @param box_count Number of detected boxes
 */
static void process_frame_detections(app_context_t *ctx, pd_pp_box_t *boxes, uint32_t box_count)
{
    /* Reset frame state */
    ctx->face_detected = false;
    ctx->face_verified = false;
    ctx->current_similarity = 0.0f;
    
    /* Reset global cropped face display variables */
    g_cropped_face_valid = false;
    g_current_similarity = 0.0f;
    
    bool target_found_this_frame = false;
    float highest_similarity = 0.0f;
    static float32_t best_embedding[EMBEDDING_SIZE];  /* Store best face embedding */
    bool best_embedding_valid = false;
    
    /* Reset embedding validity at start of frame */
    ctx->embedding_valid = 0;
    
    /* Run face recognition on ALL detected faces */
    if (box_count > 0) {
        printf("   🔍 Running face recognition on %u detected faces\n", box_count);
        
        for (uint32_t i = 0; i < box_count; i++) {
            /* Only run recognition on faces with sufficient detection confidence */
            if (boxes[i].prob >= FACE_DETECTION_CONFIDENCE_THRESHOLD) {
                printf("   🔄 Face %u: detection=%.1f%% -> ", i + 1, boxes[i].prob * 100.0f);
                
                float similarity = run_face_recognition_on_face(ctx, &boxes[i]);
                
                /* Update the box with the recognition similarity (not detection confidence) */
                boxes[i].prob = similarity;
                
                printf("recognition=%.1f%%\n", similarity * 100.0f);
                
                /* Check if this face is above threshold */
                if (similarity >= FACE_SIMILARITY_THRESHOLD) {
                    target_found_this_frame = true;
                }
                
                /* Track the face with highest similarity for display */
                if (similarity > highest_similarity) {
                    highest_similarity = similarity;
                    ctx->best_detection = boxes[i];
                    ctx->current_similarity = similarity;
                    ctx->face_detected = true;
                    
                    /* Store for LCD display */
                    g_cropped_face_valid = true;
                    g_current_similarity = similarity;
                    
                    /* Store best embedding (copy from current_embedding set by run_face_recognition_on_face) */
                    for (uint32_t j = 0; j < EMBEDDING_SIZE; j++) {
                        best_embedding[j] = ctx->current_embedding[j];
                    }
                    best_embedding_valid = true;
                }
            } else {
                /* Face detection confidence too low - skip recognition */
                printf("   ⚠️ Face %u: detection=%.1f%% (too low, skipping recognition)\n", 
                       i + 1, boxes[i].prob * 100.0f);
                /* Set very low similarity to indicate no recognition */
                boxes[i].prob = 0.05f;
            }
        }
    }
    
    /* Update target detection history */
    update_target_detection_history(ctx, target_found_this_frame);
    compute_target_detection_status(ctx);
    
