PeleAB/STM32N6-FaceRecognition/Src/main.c
    /* Store best embedding for button press functionality */
    if (best_embedding_valid) {
        for (uint32_t i = 0; i < EMBEDDING_SIZE; i++) {
            ctx->current_embedding[i] = best_embedding[i];
        }
        ctx->embedding_valid = 1;
    }
    
    /* Set verification status based on voting */
    ctx->face_verified = ctx->target_detected;
    
    printf("   🎯 Frame summary: faces=%u, target_this_frame=%s, target_detected=%s (%.1f%% best)\n",
           box_count,
           target_found_this_frame ? "YES" : "NO",
           ctx->target_detected ? "YES" : "NO",
           highest_similarity * 100.0f);
}

/**
 * @brief Update LED status based on simple voting mechanism
 * @param ctx Application context
 */
static void update_led_status(app_context_t *ctx)
{
    uint32_t current_time = HAL_GetTick();
    
    if (ctx->target_detected) {
        BSP_LED_On(LED2);   /* Green LED - target detected (3+ of last 5 frames) */
        BSP_LED_Off(LED1);
        /* Update timestamp for target detection */
        ctx->last_stable_verification_ts = current_time;
        ctx->led_timeout_active = false;
    } else if (ctx->face_detected) {
        BSP_LED_On(LED1);   /* Red LED - face detected but not verified */
        BSP_LED_Off(LED2);
        ctx->led_timeout_active = false;
    } else {
        /* No face detected - check if we should maintain green LED due to recent verification */
        if (ctx->last_stable_verification_ts != 0 && 
            (current_time - ctx->last_stable_verification_ts) < FACE_UNVERIFIED_LED_TIMEOUT_MS) {
            /* Keep green LED on for timeout period after last positive recognition */
            BSP_LED_On(LED2);
            BSP_LED_Off(LED1);
            ctx->led_timeout_active = true;
        } else {
            /* Timeout expired or no previous verification - turn off both LEDs */
            BSP_LED_Off(LED1);
            BSP_LED_Off(LED2);
            ctx->led_timeout_active = false;
        }
    }
}

/**
 * @brief Clean up neural network output buffers
 * @param nn_out Array of neural network output buffers
 * @param nn_out_len Array of buffer lengths
 * @param number_output Number of outputs
 */
static void cleanup_nn_buffers(float32_t **nn_out, int32_t *nn_out_len, int number_output)
{
    for (int i = 0; i < number_output; i++) {
        SCB_InvalidateDCache_by_Addr(nn_out[i], nn_out_len[i]);
    }
}

/**
 * @brief Main application loop
 * @param ctx Application context
 */
/* Removed unused helper functions to fix compilation warnings */


/* ========================================================================= */
/* EDUCATIONAL FACE RECOGNITION PIPELINE                                    */
/* ========================================================================= */
/*
 * This pipeline demonstrates a complete face detection and recognition system
 * with multi-face tracking capability, broken down into clear stages:
 *
 * 🔄 PIPELINE OVERVIEW:
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │  STAGE 1: Frame Capture & Preprocessing                                │
 * │  📸 Capture frame from camera → Convert to neural network format       │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 2: Face Detection Network                                       │
 * │  🧠 Run CNN to detect faces → Extract bounding boxes                   │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 3: Post-Processing & Face Tracking                             │
 * │  ⚙️ Convert network output → Track faces → Maintain consistency        │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 4: Face Recognition (Primary Face Only)                        │
 * │  🔍 Crop primary face → Run recognition → Smooth similarity scores     │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 5: System Status Update                                         │
 * │  💡 Update LEDs → Handle buttons → Send communication                  │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 6: Output & Metrics                                             │
 * │  📊 Display results → Calculate performance → Clean up                 │
 * └─────────────────────────────────────────────────────────────────────────┘
 */

/* ========================================================================= */
/* PIPELINE STAGE FUNCTIONS                                                 */
/* ========================================================================= */

/**
 * @brief Pipeline Stage 1: Frame Capture and Preprocessing
 * @param ctx Application context
 * @param pitch_nn Neural network pitch value
 * @return 0 on success, negative on error
 */
static int pipeline_stage_capture_and_preprocess(app_context_t *ctx, uint32_t pitch_nn)
{
    printf("📸 PIPELINE STAGE 1: Frame Capture\n");
    
    /* Step 1.1: Capture frame from camera or PC stream */
    if (app_get_frame(nn_rgb, pitch_nn) != 0) {
        printf("❌ Frame capture failed\n");
        return -1;
    }
    
#ifdef DUMMY_INPUT_BUFFER
    /* Step 1.1.5: Override both img_buffer and nn_rgb with dummy data for testing */
    load_dual_dummy_buffers();
#endif
    
    /* Step 1.2: Convert RGB to neural network input format */
    printf("   🔄 Converting RGB to CHW format for neural network...\n");
    img_rgb_to_chw_float(nn_rgb, (float32_t *)ctx->nn_ctx.detection_input_buffer, 
                        NN_WIDTH * NN_BPP, NN_WIDTH, NN_HEIGHT);
    


    /* Step 1.3: Prepare data for neural network (cache management) */
    printf("   🧠 Preparing %lu bytes for neural network input...\n", ctx->nn_ctx.detection_input_length);
    SCB_CleanInvalidateDCache_by_Addr(ctx->nn_ctx.detection_input_buffer, 
                                     ctx->nn_ctx.detection_input_length);
    
    printf("✅ Frame captured and preprocessed (%dx%d → %lu bytes)\n", 
           NN_WIDTH, NN_HEIGHT, ctx->nn_ctx.detection_input_length);
    return 0;
}

/**
 * @brief Pipeline Stage 2: Face Detection Neural Network
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int pipeline_stage_face_detection(app_context_t *ctx)
{
    printf("🧠 PIPELINE STAGE 2: Face Detection Network\n");
    
    /* Step 2.1: Run face detection neural network */
    printf("   🚀 Running face detection neural network inference...\n");
    uint32_t start_time = HAL_GetTick();
    RunNetworkSync(&NN_Instance_face_detection);
    uint32_t inference_time = HAL_GetTick() - start_time;
    
    /* Step 2.2: Network cleanup */
    printf("   🧹 Cleaning up neural network resources...\n");
    LL_ATON_RT_DeInit_Network(&NN_Instance_face_detection);
    
    printf("✅ Face detection completed in %lu ms (%d outputs ready)\n", 
           inference_time, ctx->nn_ctx.detection_output_count);
    return 0;
}

/**
 * @brief Pipeline Stage 3: Post-Processing and Face Extraction
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int pipeline_stage_postprocessing(app_context_t *ctx)
{
    printf("⚙️ PIPELINE STAGE 3: Post-Processing\n");
    
    /* Step 3.1: Run post-processing to extract bounding boxes */
    printf("   🔍 Processing %d neural network outputs...\n", ctx->nn_ctx.detection_output_count);
    int32_t ret = app_postprocess_run((void **) ctx->nn_ctx.detection_output_buffers, 
                                     ctx->nn_ctx.detection_output_count, 
                                     &ctx->pp_output, &ctx->pp_params);
    if (ret != 0) {
        printf("❌ Post-processing failed\n");
        return -1;
    }
    
