PeleAB/STM32N6-FaceRecognition/Src/main.c
    /* Step 3.2: Extract detected faces */
    pd_pp_box_t *boxes = (pd_pp_box_t *)ctx->pp_output.pOutData;
    printf("   📦 Extracted %d face bounding boxes\n", ctx->pp_output.box_nb);
    
    /* Step 3.3: Log detection details for educational purposes */
    for (uint32_t i = 0; i < ctx->pp_output.box_nb && i < 3; i++) {
        printf("   📍 Face %d: confidence=%.3f, center=(%.2f,%.2f), size=%.2fx%.2f\n", 
               i + 1, boxes[i].prob, boxes[i].x_center, boxes[i].y_center, 
               boxes[i].width, boxes[i].height);
    }
    
    printf("✅ Post-processing completed: %d faces detected\n", ctx->pp_output.box_nb);
    
    return 0;
}

/**
 * @brief Pipeline Stage 4: Face Recognition and Verification
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int pipeline_stage_face_recognition(app_context_t *ctx)
{
    printf("🔍 PIPELINE STAGE 4: Face Recognition\n");
    
    /* Step 4.1: Process all detected faces with recognition */
    pd_pp_box_t *boxes = (pd_pp_box_t *)ctx->pp_output.pOutData;
    process_frame_detections(ctx, boxes, ctx->pp_output.box_nb);
    
    /* Step 4.2: Log recognition results */
    if (ctx->face_detected) {
        printf("✅ Face recognition: detected=%s, verified=%s, best_similarity=%.1f%%\n",
               ctx->face_detected ? "YES" : "NO",
               ctx->face_verified ? "YES" : "NO",
               ctx->current_similarity * 100.0f);
    } else {
        printf("ℹ️ No faces above threshold detected\n");
    }
    
    return 0;
}

/**
 * @brief Pipeline Stage 5: System Status Update
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int pipeline_stage_system_update(app_context_t *ctx)
{
    printf("💡 PIPELINE STAGE 5: System Status Update\n");
    
    /* Step 5.1: Update LED status based on recognition results */
    update_led_status(ctx);
    
    /* Step 5.2: Handle user button interactions */
    handle_user_button(ctx);
    
    /* Step 5.3: Send heartbeat for PC communication */
    Enhanced_PC_STREAM_SendHeartbeat();
    
    printf("✅ System status updated\n");
    return 0;
}

/**
 * @brief Pipeline Stage 6: Output and Performance Metrics
 * @param ctx Application context
 * @param frame_start_time Start time of frame processing
 * @param boot_time System boot time
 * @return 0 on success, negative on error
 */
static int pipeline_stage_output_and_metrics(app_context_t *ctx, uint32_t frame_start_time, uint32_t boot_time)
{
    printf("📊 PIPELINE STAGE 6: Output and Metrics\n");
    
    /* Step 6.1: Calculate performance metrics */
    uint32_t frame_end_time = HAL_GetTick();
    uint32_t total_frame_time = frame_end_time - frame_start_time;
    
    ctx->frame_count++;
    ctx->performance.fps = 1000.0f / (total_frame_time + 1);
    ctx->performance.inference_time_ms = total_frame_time;
    ctx->performance.frame_count = ctx->frame_count;
    ctx->performance.detection_count = ctx->pp_output.box_nb;
    
    /* Step 6.2: Display results */
    app_output(&ctx->pp_output, total_frame_time, boot_time, ctx);
    
    /* Step 6.3: Clean up neural network buffers */
    cleanup_nn_buffers(ctx->nn_ctx.detection_output_buffers, 
                      ctx->nn_ctx.detection_output_lengths, 
                      ctx->nn_ctx.detection_output_count);
    
    printf("✅ Frame processing completed: %.1f FPS, %lu ms total\n", 
           ctx->performance.fps, total_frame_time);
    printf("═══════════════════════════════════════════════════════════\n");
    
    return 0;
}

/**
 * @brief Educational Pipeline Main Loop - Clear Stage-by-Stage Processing
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int app_main_loop(app_context_t *ctx)
{
    /* Verify at least detection network is initialized */
    if (!ctx->nn_ctx.detection_initialized) {
        printf("❌ Face detection network not initialized!\n");
        return -1;
    }
    
    uint32_t pitch_nn = 0;
    uint32_t boot_time = HAL_GetTick();
    
    /* Initialize camera and display systems */
    printf("🚀Initializing Camera and Display Systems\n");
    app_camera_init(&pitch_nn);
    app_display_init();
    app_input_start();
    printf("✅ Systems initialized, starting pipeline\n");
    printf("═══════════════════════════════════════════════════════════\n");
    
    /* Main processing loop with clear pipeline stages */
    while (1) {
        uint32_t frame_start_time = HAL_GetTick();
        printf("🔄 STARTING FRAME %lu PROCESSING PIPELINE\n", ctx->frame_count + 1);

        /* Stage 1: Frame Capture and Preprocessing */
        if (pipeline_stage_capture_and_preprocess(ctx, pitch_nn) != 0) {
            continue; /* Skip this frame on error */
        }
        //HINT: for dummy input the first elements of (float32_t *)ctx->nn_ctx.detection_input_buffer should look like: {206, 209, 211, 212, 213, 213, 214, 214, 214, 214, 213 <repeats 14 times>, 212, 212, 211, 208, 207, 204, 199, 193, 189, 182, 174, 163, 151, 139, 129, 119, 110, 104, 104, 106, 108, 114, 121, 126, 132, 137, 140, 141, 147, 152, 152, 152, 153, 153, 154, 154, 154, 154, 153, 151, 152, 152, 151, 150, 149, 149, 147, 146, 142, 135, 126, 114, 107, 97, 87, 73, 60, 47, 32, 19, 12, 14, 19, 26, 32, 37, 42, 52, 60, 63, 67, 70, 70, 71, 72, 72}

        /* Stage 2: Face Detection Neural Network */
        if (pipeline_stage_face_detection(ctx) != 0) {
            continue; /* Skip this frame on error */
        }
        
        //HINT: for dummy input the first elements of ctx->nn_ctx.detection_output_buffers[0] should look like: {1.89764965, 1.77754533, 1.62140954, 1.64543045, 1.68146181, 1.68146181, 1.92167056...}

        /* Stage 3: Post-Processing and Face Extraction */
        if (pipeline_stage_postprocessing(ctx) != 0) {
            continue; /* Skip this frame on error */
        }
        
        //HINT: for dummy input the cctx->pp_output->pOutData.x_center = 0.5113132 ctx->pp_output->pOutData.y_center = 0.543815017

        /* Stage 4: Face Recognition and Verification */
        if (pipeline_stage_face_recognition(ctx) != 0) {
            continue; /* Skip this frame on error */
        }
        
